# IsFillColorByClass

## Description
Function IsFillColorByClass returns whether class fill colors are used for the referenced object.

```pascal
FUNCTION IsFillColorByClass(h : HANDLE) : BOOLEAN;
```

```python

def vs.IsFillColorByClass(h):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Remarks
Returns an indication of whether the class fill colors are used for the object referenced by h.<BR>
[sd 8/19/98]

## Version
Availability: from VectorWorks8.0
## Category
* Object Attributes